In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
path = os.path.join("Resources" , "purchase_data.csv")

In [3]:
df = pd.read_csv(path)

In [4]:
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [5]:
df["SN"].value_counts()

Lisosia93        5
Iral74           4
Idastidru52      4
Lisopela58       3
Hiaral50         3
                ..
Iskossasda43     1
Mindirranya33    1
Raillydeu47      1
Tyaerith73       1
Undassa89        1
Name: SN, Length: 576, dtype: int64

In [6]:
#df.dropna().shape

In [7]:
total_player=len(df["SN"].value_counts())
total_player
total_player_df =pd.DataFrame({
    "total_player": [total_player]
})
total_player_df

   total_player
0           576

In [8]:
df["Item ID"].value_counts()

178    12
82      9
108     9
145     9
92      8
       ..
42      1
118     1
104     1
27      1
51      1
Name: Item ID, Length: 183, dtype: int64

In [9]:
uniqe_item=len(df["Item ID"].value_counts())
uniqe_item

183

In [10]:
avrage_price=df["Price"].sum()/df["Price"].count()
avrage_price

3.0509871794871795

In [11]:
#df.dropna(how="all")

In [12]:
purches_total=df["Price"].count()
purches_total

780

In [13]:
total_Revenue=df["Price"].sum()
total_Revenue

2379.77

In [14]:
purchesing_analysis=pd.DataFrame({
    "uniqe_items":[uniqe_item],
    "avrage_prices":[avrage_price],
    "purches_totals":[purches_total],
    "total_Revenues":[total_Revenue] 
    })
purchesing_analysis

   uniqe_items  avrage_prices  purches_totals  total_Revenues
0          183       3.050987             780         2379.77

In [15]:
df_count=df[["SN","Gender","Age"]]

In [16]:
gender_df_count=df_count.drop_duplicates()
gender_count = gender_df_count["Gender"].value_counts()
gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [17]:
gender_count_df=pd.DataFrame(gender_count)
gender_count_df

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [18]:
#sum_of_all_gender = gender_count_df["Gender"].sum()
#sum_of_all_gender

In [19]:
gender_count_df["Percentage"]=gender_count_df["Gender"]/gender_count_df["Gender"].sum()
gender_count_df
#gender_count_df["Percentage"]=gender_count_df["Gender"]/sum_of_all_gender
#gender_count_df

                       Gender  Percentage
Male                      484    0.840278
Female                     81    0.140625
Other / Non-Disclosed      11    0.019097

In [20]:
gender_count_df["Percentage"]=(gender_count_df["Gender"]/gender_count_df["Gender"].sum()).map("{:,.2%}".format)
gender_count_df

                       Gender Percentage
Male                      484     84.03%
Female                     81     14.06%
Other / Non-Disclosed      11      1.91%

In [21]:
gender_count_df["Gender"].sum()

576

In [22]:
uniqe_item = df["Item ID"].nunique()
uniqe_item

183

In [23]:
purchase_count =df["Purchase ID"].count()
purchase_count

780

In [24]:
price_average = df["Price"].mean()
price_average

3.0509871794871795

In [25]:
total_value = df["Price"].sum()
total_value

2379.77

In [26]:
purchesing_gender_analysis= pd.DataFrame({
    "Number of Unique Items":[uniqe_item],
    "Avrage Purchase Price":[price_average],
    "ToTal Value":[total_value],
    "Total Number of Perchases":[purchase_count],
    "Total Revenue":[purchase_count]
})
#purchesing_gender_analysis=purchesing_gender_analysis.format({"Avrage Purchase Price" : "${:,.2f}", "Total Revenue" : "${:,.2f}"})
purchesing_gender_analysis

,Number of Unique Items,Avrage Purchase Price,ToTal Value,Total Number of Perchases,Total Revenue
0,183,3.050987,2379.77,780,780

In [27]:
gender = df.groupby(["Gender"])
g_purchase_count= gender["SN"].count()
g_purchase_price= gender["Price"].mean()
g_purchase_value= gender["Price"].sum()
duplicates = df.drop_duplicates(subset="SN",keep="first")
grouped_duplicate = duplicates.groupby(["Gender"])
purchase_normalized= (gender["Price"].sum()/grouped_duplicate["SN"].count())

In [28]:
purchase_gender= pd.DataFrame({
    "Purchase Count":g_purchase_count,
    "Avrage Purchase Price":g_purchase_price,
    "Total Purchase Value":g_purchase_value,
    "Normalized Total":purchase_normalized,
})
purchase_gender['Avrage Purchase Price']=purchase_gender['Avrage Purchase Price'].map("${:.2f}".format)
purchase_gender['Total Purchase Value']=purchase_gender['Total Purchase Value'].map("${:.2f}".format)
purchase_gender['Normalized Total']= purchase_gender['Normalized Total'].map("${:.2f}".format)
#purchase_gender = purchase_gender[["Purchase Count","Total Purchase Value","Normalized Total"]]
purchase_gender

,Purchase Count,Avrage Purchase Price,Total Purchase Value,Normalized Total
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [29]:
bins_range=[0, 9, 14, 19, 24, 29, 30,39, 100000]
bins_labels=["<10","10-14","15-19","20-24","25-29","30-34","35-39","+40"]
df["Age Demo"]= pd.cut(df["Age"], bins_range , labels=bins_labels)
age_base=pd.DataFrame(df.groupby("Age Demo").SN.nunique())
age_base

           SN
Age Demo
<10        17
10-14      22
15-19     107
20-24     258
25-29      77
30-34      25
35-39      58
+40        12

In [30]:
#age_purchasing=df
#age_purchasing["Age Group"]=pd.cut(df["Age"],bins_range, )

In [31]:
age_base=age_base.rename(index=str, columns={"SN":"Total Player"})
age_base["Percentage of Players"]= age_base["Total Player"]/sum(age_base["Total Player"])*100
age_base["Percentage of Players"]= age_base["Percentage of Players"].map ("{:.2f}%".format)
# age_base['Percentage of Players'] = age_base.style.format({"Percentage of Players":"{:.2f}%"})
age_base

          Total Player Percentage of Players
Age Demo
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               25                 4.34%
35-39               58                10.07%
+40                 12                 2.08%

In [32]:
df['Age Ranges']=pd.cut(df["Age"], bins_range , labels=bins_labels)
purchase_total=df.groupby("Age Ranges").sum()["Price"]
purchase_count = df.groupby("Age Ranges").count()["Price"]
purchase_average= df.groupby("Age Ranges").mean()["Price"]
total_purchase_per= purchase_total / age_base["Total Player"]
age_base_data=pd.DataFrame({
    "Total Purchase":purchase_total,
    "Purchase Count":purchase_count,
    "Purchase Avrage":purchase_average,
    "Total Per Person":total_purchase_per
    
})
age_base_data
#Purchase CountAverage Purchase PriceTotal Purchase ValueAvg Total Purchase per Person

            Total Purchase  Purchase Count  Purchase Avrage  Total Per Person
Age Ranges
<10                  77.13              23         3.353478          4.537059
10-14                82.78              28         2.956429          3.762727
15-19               412.89             136         3.035956          3.858785
20-24              1114.06             365         3.052219          4.318062
25-29               293.00             101         2.900990          3.805195
30-34               110.32              35         3.152000          4.412800
35-39               251.35              79         3.181646          4.333621
+40                  38.24              13         2.941538          3.186667

In [33]:

top_spender=df["Item ID"].groupby(df["SN"]).count()
top_spender=pd.DataFrame(data=top_spender)
top_spender.columns = ["Purchase Count"]
top_spender["Avrage Purchase Price"] = round(df["Price"].groupby(df["SN"]).mean(),2)
top_spender["Total Purchase Value"]=df["Price"].groupby(df["SN"]).sum()
top_spender.sort_values(by=["Total Purchase Value"],ascending=False,inplace=True)
top_spender["Avrage Purchase Price"].map("${:,.2f}".format)
top_spender["Total Purchase Value"].map("${:,.2f}".format)
top_spender.head()

             Purchase Count  Avrage Purchase Price  Total Purchase Value
SN
Lisosia93                 5                   3.79                 18.96
Idastidru52               4                   3.86                 15.45
Chamjask73                3                   4.61                 13.83
Iral74                    4                   3.40                 13.62
Iskadarya95               3                   4.37                 13.10

In [34]:
most_profit= df.groupby(["Item ID","Item Name","Price"])["Price"].agg({"count","sum"})
most_profit.columns = ["Total Purchase Value","Purchase Count"]
most_profit.reset_index(inplace=True)
most_profit.set_index(["Item ID","Item Name"],inplace=True)
most_profit=most_profit.sort_values(by="Total Purchase Value",ascending=False)
most_profit["Price"]=most_profit["Price"].map("${:,.2f}".format)
most_profit["Total Purchase Value"]=most_profit["Total Purchase Value"].map("${:,.2f}".format)
most_profit.head()

,,Price,Total Purchase Value,Purchase Count
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",$4.23,$50.76,12
82,Nirvana,$4.90,$44.10,9
145,Fiery Glass Crusader,$4.58,$41.22,9
92,Final Critic,$4.88,$39.04,8
103,Singed Scalpel,$4.35,$34.80,8

In [81]:
most_profit=most_profit.sort_values(by="Purchase Count",ascending=False)
#top_value = most_profit[0:5]
#top_value = top_value .style.format({"Total Purchase Value":"${:.2f}","Price":"${:.2f}"})
most_profit["Price"]=most_profit["Price"]
#.map("${:,.2f}".format)
most_profit["Total Purchase Value"]=most_profit["Total Purchase Value"]
# .map("${:,.2f}".format)
most_profit.head()
#top_value

,,Price,Total Purchase Value,Purchase Count
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",$4.23,$50.76,12
145,Fiery Glass Crusader,$4.58,$41.22,9
108,"Extraction, Quickblade Of Trembling Hands",$3.53,$31.77,9
82,Nirvana,$4.90,$44.10,9
34,Retribution Axe,$2.22,$17.76,8